const pageIdMapping = {
    '0200': 'ap1010',//跨级审批
    '0300': 'ap1020',//预受理
    '0400': 'ap1030',//预受理审核
    '0500': 'ap1040',//受理登记
    '0600': 'ap1050',//收检一览
    '0601': 'ap1051',//收检
    '0700': 'ap1060',//检验鉴定
    '0800': 'ap1080',//文书拟稿
    '0900': 'ap1090',//鉴定复核
    '1000': 'ap1100',//技术审批
    '1100': 'ap1200',//程序审批
    '1200': 'ap1300',//领导审批
    '1300': 'ap1400',//打印报告
    '1400': 'ap1500',//提交归档
    '1500': 'ap1600',//确认归档
    '1600': 'ap1700',//文书发放
    '1700': 'ap1800',//业务科长审核 
    '1800': 'ap1803' //业务主任审批
};

export default pageIdMapping;